'use strict';

const temporal_phrases = [
  /([一二三四五六七八九]?十)?[一二三四五六七八九]年/, '元年', 
  /[一二三四五六七八九十]月/, '十一月', '十二月', '正月', 
  /([一二三四五六七八九]?十)?[一二三四五六七八九]日/, 
  '元日', '朔日', '晦日', 
  '甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉', 
  '甲戌', '乙亥', '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未', 
  '甲申', '乙酉', '丙戌', '丁亥', '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳', 
  '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥', '庚子', '辛丑', '壬寅', '癸卯', 
  '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥', '壬子', '癸丑', 
  '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥', 
  '春', '夏', '秋', '冬', '時', /([一二三四五六七八九]?十)?[一二三四五六七八九]歳/, 
  /年([一二三四五六七八九]?十)?[一二三四五六七八九]/
];

const locations = [
  '洛陽', '長安', '京兆', '京師', 
  '琅邪', '太原', '許昌', '成都', '汝南', '潁川', '漢陽', 
  '中山', '清河', '渤海', '弘農', '華陰', '渭水', '淮南', '邯鄲', 
  '秦', '楚', '斉', '齊', '燕', '趙', '魏', '韓', '呉', '吳', '蜀', '巴', 
  '漢', '晉', '晋', 
  '五丈原', '赤壁', 
  /[幽涼荊青揚豫冀益兗兖雍并徐梁]州/
];

const social_positions = [
  /皇[祖考叔]/, /皇?太后/, 
  '天子', '皇帝', '帝', '聖上', '陛下', 
  /[單単]于/, 
  '王', '公', '侯', '伯', '殿下', 
  '后', '妃', '皇后', '妃嬪', '太妃', '貴嬪', '夫人', '貴人', 
  /[貴淑徳賢]妃/, /昭[儀容媛]/, /淑[媛儀]/, /[修充][媛華容儀]/, 
  '婕妤', '容華', '美人', /中?才人/, 
  '皇太子', '太子', '公子', '皇子', '世子', 
  '長公主', '公主', /[鄉郷]主/, '帝姫',
  /[縣県鄉郷][公侯]/, /[亭鄉郷列諸]侯/, '郡公', 
  '太尉', '太傅', '少傅', 
  '司徒', '司隸', '司馬', '司空', '丞相', 
  /大?[將将]軍/, /(驃騎|驍騎|車騎|鎮軍)([將将]軍)?/, 
  /[前後左右衛][將将]軍/, /[征鎮][東西南北](大?[將将]軍)?/, 
  /中郎[將将]/, 
  /光[祿禄][勳勲]?/,
  /[黃黄]門郎?/,
  '散騎', '常侍', '侍中', '給事', '侍郎', 
  '太守', '刺史', /大?都督/, '校尉', '御史', 
  '附馬', /騎?都尉/, 
  '吏部',
  /相[國国]/, 
  /尚書[令郎]?/, 
  /中書[令郎監]?/, 
  '太常', '太保', 
  /(左右|左|右)?(僕射|長史)/,
  /[舍舎]人/, '大夫', '博士', '祭酒', 
  '員外', 
  '儀同三司', '開府', '特進', /[持仮假]節/
];

const relatives = [
  '祖', /外?祖[父母]/, 
  '父', '母', '舅', '姑', '姨', /[伯叔從従族]父/, /堂[伯叔姑]/, 
  /[堂表從従]?[兄弟姉姊妹]/, /[異同][父母][兄弟姉姊妹]/, 
  '嫂', 
  '夫', '妻', 
  /[長次二三四五六七八九十幼少]?[子女]/, '庶子', 
  '甥', '姪', /[侄族從従]子/, 
  /外?孫女?/, 
  '曽孫', '玄孫', '裔'
];

const name_types = [
  '諱', '字', '姓', '氏', '号', '廟', '諡'
];

const functional_words = [
  '非', '不', '無', '未', '莫', 
  '有', 
  '即', '乃', '輒', '則', '而', '又', '亦', '并', '復', '且', '已', 
  '但', '雖', '或', '毎', '每', 
  '所', '以', '将', '將', '須', '当', '當', '使', '令', '況', 
  '能', '可', '欲', '被', 
  '之', 
  '於', '在', '于', '中', 
  '由', '自', '従', '從', 
  '其', '是', '者', '此', 
  '為', '爲', 
  '與', 
  '何', 
  '曰', 
  '耳', '也', '哉', '乎', '焉', '矣'
];

const personal_names = [];

const cls_kw_pairs = [
  ['fn', functional_words], 
  ['rel', relatives], 
  ['typ', name_types], 
  ['tmp', temporal_phrases], 
  ['loc', locations], 
  ['soc', social_positions], 
  ['prs', personal_names]
];

